stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg_timer.c
/**
  ******************************************************************************
  * @file    stm32wl3x_hal_mrsubg_timer.c
  * @author  GPM WBL Application Team
  * @brief   Virtual timer and MRSUBG timer high level APIs
  * @details This file implements the software layer that provides the virtualization of the
  * resources of a single hardware radio timer in order to allocate many user virtual timers.
  * The only constraint to the number of virtual timers is the memory.
  * Each instance of a virtual timer is placed in an queue ordered by the expiration time
  * and it can be linked to a callback.
  * The timer tick is in charge to execute the callback linked to each virtual timer
  * and to update the hardware timeout to guarantee the expiration of the next virtual
  * timer in the queue.
  * A special virtual timer called calibration/anti-wrapping timer is automatically armed
  * by the software. This timer can address two tasks:
  * - it is in charge to maintain the never wrapping virtual time base.
  * - if the slow clock calibration is enabled, it starts the calibration procedure at each
  * calibration interval specified during the initialization.
  *
  * A timer is intended as an event programmed in the future at a certain absolute expiration time
  * on a time base. In this implementation the time base grows on 64 bits. Then, it never wraps.
  * However, due to hardware timer finite length and in order to maintain the timing coherency, the time base
  * must be maintained at least one time before the hardware timer wraps.
  * Then even if the slow clock calibration is disabled, the calibration/anti-wrapping timer
  * is always active with the only role to maintain the time base and it will expire
  * at a rate that depends on the hardware timer capability.
  * The time base unit is a STU that is the unit exposed to the user and it is equal to 1 us.
  * The calibration/anti-wrapping mechanism is not managed by the user.
  *
  * This software layer also exposes the possibility to read if a radio timer is programmed.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x_hal.h"

/** @addtogroup STM32WL3x_HAL_Driver
  * @{
  */

/** @defgroup MRSUBG_TIMER MRSUBG TIMER
  * @{
  */

#ifdef HAL_MRSUBG_TIMER_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/

/** @defgroup MRSUBG_TIMER_Private_Types MRSUBG TIMER Private Types
  * @{
  */

typedef struct
{
  VTIMER_HandleType_t calibrationTimer;
  VTIMER_HandleType_t *rootNode; /*!< First timer of the host timer queue */
  uint8_t enableTimeBase;      /*!< Internal flag. User can ignore it*/
  uint8_t expired_count; /*!< Progressive number to indicate expired timers */
  uint8_t served_count; /*!< Progressive number to indicate served expired timers */
  uint8_t stop_notimer_action; /*!< Flag to indicate DEEPSTOP no timer action */
  uint64_t cumulative_time; /** Absolute system time since power up */
  uint32_t hs_startup_time; /** HS startup time in us */
  uint32_t last_scm_counter; /** Number of 16Mhz fast clock cycles seen in a 32 slow clock \
                              period window read in the last calibration*/
  uint32_t fast_clock_freq; /** The fast clock frequency is XO frequency / 3 so typically 16MHz. \
                              But it can also be 15.666MHz with a XO at 47MHz or 16.666MHz with a XO at 50MHz. */
  uint32_t slow_clock_freq; /** Slow clock freq */
  uint32_t interpolated_freq; /** Interpolated frequency */
  uint32_t last_interpolated_freq; /** Last interpolated frequency */
  uint64_t timer_max_value; /** TIMER_MAX_VALUE in System Time Unit (1us) */
  uint32_t last_calibration_machine_time; /** Last machine time when calibration was performed */
  uint32_t calibration_machine; /** Calibration Interval MTU */
  uint64_t last_system_time; /** Last System Time */
  uint64_t last_calibration_time; /** Absolute system time when last calibration was performed */
  uint8_t  calibration_in_progress;  /*!< Flag to indicate that a periodic calibration has been started */
  uint64_t periodicCalibrationInterval; /** Calibration Interval in system time unit (us) */
  uint8_t  periodic_calibration; /** Tells whether periodic hardware calibration is needed or not, i.e. \
                                  LSO speed varies with temperature, etc. */
} MRSUBG_TIMER_ContextTypeDef;

/**
  * @}
  */

/* Private define ------------------------------------------------------------*/
/** @defgroup MRSUBG_Timer_Private_Defines MRSUBG TIMER Private Defines
  * @{
  */

/* Extra margin to consider before going in low power mode */
#define LOW_POWER_THR_STU (60)
#define LOW_POWER_THR_MTU (30)

/* Automatic Calibration interval 5 sec */
#define FIVE_SECONDS 5000000
/* Assumed slow clock working frequency to be at 32.768 kHz */
#define SLOW_CLOCK_WORKING_FREQ 32768
/* Max attempt number for SCM to exit transitory phase and reach working frequency */
#define MAX_SCM_DELAY_COUNT 10
/* ms to wait between SCM reads during transitory phase */
#define SCM_DELAY_MS 5
/* maximum time required to enter low power mode */
#define LOW_POWER_ENTRY_MARGIN_US 150

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/** @defgroup MRSUBG_Timer_Private_Macros MRSUBG TIMER Private Macros
  * @{
  */

#define ATOMIC_SECTION_BEGIN() uint32_t uwPRIMASK_Bit = __get_PRIMASK(); \
  __disable_irq(); \
  /* Must be called in the same scope of ATOMIC_SECTION_BEGIN */
#define ATOMIC_SECTION_END() __set_PRIMASK(uwPRIMASK_Bit)

#define MAX(a,b) ((a) < (b) )? (b) : (a)
#define MIN(a,b) ((a) < (b) )? (a) : (b)
#define DIFF8(a,b) ((a)>=(b) ? ((a)-(b)) : (256+((a)-(b))))
#define TIME_DIFF(a, b)       (((int32_t)((a - b) << (32-TIMER_BITS))) >> (32-TIMER_BITS))
/* This define assumes that a is always greater than b */
#define TIME_ABSDIFF(a, b)       ((a - b) & TIMER_MAX_VALUE)
#define INCREMENT_EXPIRE_COUNT_ISR (MRSUBG_TIMER_Context.expired_count \
                                    = ((MRSUBG_TIMER_Context.expired_count + 1) == MRSUBG_TIMER_Context.served_count) \
                                      ? MRSUBG_TIMER_Context.expired_count : (MRSUBG_TIMER_Context.expired_count + 1))
#define INCREMENT_EXPIRE_COUNT ATOMIC_SECTION_BEGIN(); INCREMENT_EXPIRE_COUNT_ISR ; ATOMIC_SECTION_END();

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup MRSUBG_Timer_Private_Variables MRSUBG TIMER Private Variables
  * @{
  */
static MRSUBG_TIMER_ContextTypeDef MRSUBG_TIMER_Context;
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup MRSUBG_Timer_Private_Constants MRSUBG TIMER Private Constants
  * @{
  */

/** Margin arging to take for long sleep to allow the
  * system to avoid to have the counter wrapping. It is expressed in machine
  * time, so it is variable when using internal RO
  */
#define TIMER_WRAPPING_MARGIN (4096)
/** Number of significant bits in the radio timer */
#define TIMER_BITS (32)
#define TIMER_MAX_VALUE (0xFFFFFFFFU >> (32-TIMER_BITS))

/**
  * @}
  */

