stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg_timer.c
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup MRSUBG_Timer_Private_Functions
  * @{
  */
/* Privati Calibration APIs */
static void _get_calibration_data(void);
static void _timer_calibrate(void);
static void _updateCalibrationData(void);
static void _calibration_callback(void *handle);
static void _update_xtal_startup_time(void);
static void _update_system_time(void);
static uint64_t _us_to_machinetime(uint64_t time);
static uint64_t _machinetime_to_us(uint64_t time);
static uint64_t _get_system_time_and_machine(uint32_t *current_machine_time);
static int32_t _start_timer(VTIMER_HandleType_t *timerHandle, uint64_t time);
static VTIMER_HandleType_t *_update_user_timeout(VTIMER_HandleType_t *rootNode, uint8_t *expired);
static uint32_t VTIMER_SetWakeupTime(uint64_t delay, BOOL allow_sleep);
static VTIMER_HandleType_t *_insert_timer_in_queue(VTIMER_HandleType_t *rootNode, VTIMER_HandleType_t *handle);
static void _virtualTimeBaseEnable(FunctionalState state);
static VTIMER_HandleType_t *_remove_timer_in_queue(VTIMER_HandleType_t *rootNode, VTIMER_HandleType_t *handle);
static VTIMER_HandleType_t *_check_callbacks(VTIMER_HandleType_t *rootNode, VTIMER_HandleType_t **expiredList);

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup MRSUBG_Timer_Exported_Functions MRSUBG Timer Exported Functions
  * @{
  */

/* ------------------------ RADIO Init APIs ----------------------------------*/
/**
  * @brief  Initialize the radio timer module. It must be placed in the initialization
  *         section of the application.
  * @param MRSUBG_TIMER_InitStruct Radio Timer Initialization parameters
  * @retval None
  */
void HAL_MRSUBG_TIMER_Init(MRSUBG_TIMER_InitTypeDef *MRSUBG_TIMER_InitStruct)
{
  /* Wait to be sure that the Radio Timer is active */
  while (LL_MRSUBG_TIMER_GetAbsoluteTime(MR_SUBG_GLOB_MISC) < 0x10);

  /* Interrupt Configuration */
  LL_MRSUBG_TIMER_ClearFlag_CPUWakeup(MR_SUBG_GLOB_MISC);
  HAL_MRSUBG_TIMER_MspInit();

  /* HSE XTAL clock frequency */
  MRSUBG_TIMER_Context.fast_clock_freq = MRSUBG_TIMER_InitStruct->HSE_XTAL_freq / 3;

  /* Calibration Setting */
  MRSUBG_TIMER_Context.periodic_calibration = (MRSUBG_TIMER_InitStruct->periodicCalibrationInterval != 0);
  if (MRSUBG_TIMER_Context.periodic_calibration || MRSUBG_TIMER_InitStruct->enableInitialCalibration)
  {
    _timer_calibrate();
  }
  else
  {
    /* Assume fix frequency at 32.768 kHz */
    MRSUBG_TIMER_Context.slow_clock_freq = SLOW_CLOCK_WORKING_FREQ;
    MRSUBG_TIMER_Context.interpolated_freq = 16u * MRSUBG_TIMER_Context.slow_clock_freq;
    MRSUBG_TIMER_Context.last_interpolated_freq = MRSUBG_TIMER_Context.interpolated_freq;
    MRSUBG_TIMER_Context.timer_max_value = (
                                             ((uint64_t)TIMER_MAX_VALUE * 1000000ull) /
                                             MRSUBG_TIMER_Context.interpolated_freq
                                           );
  }
  if (MRSUBG_TIMER_InitStruct->periodicCalibrationInterval == 0)
  {
    MRSUBG_TIMER_Context.calibration_machine = TIMER_MAX_VALUE - TIMER_WRAPPING_MARGIN;
  }
  else
  {
    MRSUBG_TIMER_Context.calibration_machine =  MIN(_us_to_machinetime \
                                                    (MRSUBG_TIMER_InitStruct->periodicCalibrationInterval * \
                                                     1000ull),
                                                    (TIMER_MAX_VALUE - TIMER_WRAPPING_MARGIN));
  }
  MRSUBG_TIMER_Context.periodicCalibrationInterval = _machinetime_to_us(\
                                                                        MRSUBG_TIMER_Context.calibration_machine);
  MRSUBG_TIMER_Context.calibration_in_progress = FALSE;

  /* XTAL startup time configuration */
  MRSUBG_TIMER_Context.hs_startup_time = MRSUBG_TIMER_InitStruct->XTAL_StartupTime;
  _update_xtal_startup_time();

  /* Init Radio Timer Context */
  MRSUBG_TIMER_Context.last_calibration_machine_time = LL_MRSUBG_TIMER_GetAbsoluteTime(MR_SUBG_GLOB_MISC);
  MRSUBG_TIMER_Context.last_system_time = 0;
  MRSUBG_TIMER_Context.last_calibration_time = _machinetime_to_us(MRSUBG_TIMER_Context.last_calibration_machine_time);
  MRSUBG_TIMER_Context.cumulative_time = MRSUBG_TIMER_Context.last_calibration_time;

  /* Init the Virtual Timer queue */
  MRSUBG_TIMER_Context.rootNode = NULL;
  MRSUBG_TIMER_Context.enableTimeBase = TRUE;
  MRSUBG_TIMER_Context.stop_notimer_action = FALSE;
  MRSUBG_TIMER_Context.expired_count = 0;
  MRSUBG_TIMER_Context.served_count = 0;

  /* Configure the Calibration callback and schedule the next calibration */
  MRSUBG_TIMER_Context.calibrationTimer.callback = _calibration_callback;
  MRSUBG_TIMER_Context.calibrationTimer.userData = NULL;
  _start_timer(&MRSUBG_TIMER_Context.calibrationTimer,
               HAL_MRSUBG_TIMER_GetCurrentSysTime() + MRSUBG_TIMER_Context.periodicCalibrationInterval);
}

/**
  * @brief Timer module state machine. Check and schedule the calibration.
  * Check expired timers and execute user callback.
  * It must be placed inside the infinite loop.
  * @retval None
  */
void HAL_MRSUBG_TIMER_Tick(void)
{
  uint8_t expired = 0;

  /* Check for expired timers */
  while (DIFF8(MRSUBG_TIMER_Context.expired_count, MRSUBG_TIMER_Context.served_count))
  {
    VTIMER_HandleType_t *expiredList, *curr;
    uint8_t to_be_served = DIFF8(MRSUBG_TIMER_Context.expired_count, MRSUBG_TIMER_Context.served_count);

    MRSUBG_TIMER_Context.rootNode = _check_callbacks(MRSUBG_TIMER_Context.rootNode, &expiredList);

    /* Call all the user callbacks */
    curr = expiredList;
    while (curr != NULL)
    {
      /* Save next pointer, in case callback start the timer again */
      VTIMER_HandleType_t *next = curr->next;
      curr->active = FALSE;
      if (curr->callback)
      {
        curr->callback(curr);  /* we are sure a callback is set?*/
      }
      curr = next;
    }

    MRSUBG_TIMER_Context.rootNode = _update_user_timeout(MRSUBG_TIMER_Context.rootNode, &expired);
    if (expired == 1)
    {
      /* A new root timer is already expired, mimic timer expire */
      INCREMENT_EXPIRE_COUNT;
    }

