stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg_timer.c
    MRSUBG_TIMER_Context.served_count += to_be_served;
  }

  /* Check for periodic calibration */
  if (MRSUBG_TIMER_Context.calibration_in_progress)
  {
    if (LL_MRSUBG_TIMER_GetSCM(MR_SUBG_GLOB_MISC) != 0)
    {
      /* Calibration is completed */
      MRSUBG_TIMER_Context.calibration_in_progress = FALSE;
      /* Collect calibration data */
      _updateCalibrationData();
      HAL_MRSUBG_TIMER_StopVirtualTimer(&MRSUBG_TIMER_Context.calibrationTimer);
      /* Schedule next calibration event */
      _start_timer(&MRSUBG_TIMER_Context.calibrationTimer,
                   HAL_MRSUBG_TIMER_GetCurrentSysTime() + MRSUBG_TIMER_Context.periodicCalibrationInterval);
    }
  }
}

/**
  * @brief  Returns the admitted low power mode according to the next timer activity.
  * @return Low Power mode
  */
PowerSaveLevels HAL_MRSUBG_TIMER_PowerSaveLevelCheck(void)
{
  uint32_t nextRadioActivity;
  uint8_t timerState;
  uint64_t current_time;
  uint32_t hs_startup_machine_time;
  PowerSaveLevels level;

  if (((MRSUBG_TIMER_Context.expired_count == MRSUBG_TIMER_Context.served_count)
       && !MRSUBG_TIMER_Context.calibration_in_progress) == FALSE)
  {
    return POWER_SAVE_LEVEL_DISABLED;
  }

  level = POWER_SAVE_LEVEL_DEEPSTOP_NOTIMER;

  timerState = HAL_MRSUBG_TIMER_GetRadioTimerValue(&nextRadioActivity);

  /*Wakeup timer are programmed only through the timer module*/
  if (timerState == WAKEUP_MRSUBG_TIMER_BUSY)
  {
    hs_startup_machine_time = _us_to_machinetime(MRSUBG_TIMER_Context.hs_startup_time);
    if (TIME_ABSDIFF(nextRadioActivity,
                     LL_MRSUBG_TIMER_GetAbsoluteTime(MR_SUBG_GLOB_MISC)) < \
        (hs_startup_machine_time + LOW_POWER_THR_MTU))
    {
      return POWER_SAVE_LEVEL_SLEEP;
    }

    level = POWER_SAVE_LEVEL_DEEPSTOP_TIMER;
  }

  if (MRSUBG_TIMER_Context.rootNode != NULL && MRSUBG_TIMER_Context.rootNode->active)
  {
    current_time = HAL_MRSUBG_TIMER_GetCurrentSysTime();
    /* Timer in the past */
    if (MRSUBG_TIMER_Context.rootNode->expiryTime < current_time)
    {
      /* Active timer has expired but wasn't handled by it's callback, go handle it */
      INCREMENT_EXPIRE_COUNT;
      return POWER_SAVE_LEVEL_DISABLED;
    }
    /* Timer in the future */
    else
    {
      /* Active timer is about to expire: within the necessary time to enter in low power state */
      if (MRSUBG_TIMER_Context.rootNode->expiryTime < (current_time + LOW_POWER_ENTRY_MARGIN_US))
      {
        return POWER_SAVE_LEVEL_DISABLED;
      }
      /* Active timer is about to expire: within the necessary time to wakeup from deepstop */
      else if (MRSUBG_TIMER_Context.rootNode->expiryTime < (current_time + LOW_POWER_THR_STU +
                                                            MRSUBG_TIMER_Context.hs_startup_time))
      {
        return POWER_SAVE_LEVEL_SLEEP;
      }
    }

    if (level == POWER_SAVE_LEVEL_DEEPSTOP_NOTIMER)
    {
      if ((MRSUBG_TIMER_Context.rootNode->next == NULL)
          && (MRSUBG_TIMER_Context.rootNode == &MRSUBG_TIMER_Context.calibrationTimer))
      {
        MRSUBG_TIMER_Context.stop_notimer_action = TRUE;
        _virtualTimeBaseEnable(DISABLE);
        LL_MRSUBG_TIMER_DisableCPUWakeupTimer(MR_SUBG_GLOB_RETAINED);
        return POWER_SAVE_LEVEL_DEEPSTOP_NOTIMER;
      }
    }
    level = POWER_SAVE_LEVEL_DEEPSTOP_TIMER;
  }

  return level;
}

/* ---------------------- RADIO Activity APIs --------------------------------*/

/**
  * @brief  Return the status of the RFIP Wakeup timer and the last value programmed in the register.
  * @param  time: return the RFIP Wakeup time.
  * @retval 0 if no timer has been programmed.
  * @retval 1 if RFIP Wakeup Timer has been programmed.
  */
uint8_t HAL_MRSUBG_TIMER_GetRadioTimerValue(uint32_t *time)
{
  uint8_t status = 0;

  *time = 0;
  if (LL_MRSUBG_TIMER_IsEnabledRFIPWakeupTimer(MR_SUBG_GLOB_RETAINED))
  {
    *time = LL_MRSUBG_TIMER_GetRFIPWakeupTime(MR_SUBG_GLOB_RETAINED);
    status = WAKEUP_MRSUBG_TIMER_BUSY;
  }

  return status;
}

/* ----------------------- Radio Timer time unit APIs ------------------------*/

/**
  * @brief  Translates time in microseconds into machine time units.
  * @param  time: Microseconds to be converted in MTU
  * @return Machine time value
  */
uint64_t HAL_MRSUBG_TIMER_UsToMachinetime(uint64_t time)
{
  return _us_to_machinetime(time);
}

/**
  * @brief  Translates time machine time in microseconds.
  * @param  time: Machine time to be converted in microseconds
  * @return Time value in microseconds
  */
uint64_t HAL_MRSUBG_TIMER_MachinetimeToUs(uint64_t time)
{
  return _machinetime_to_us(time);
}

/**
  * @brief  This function returns the current reference time expressed in system time units (1us).
  *         The returned value can be used as absolute time parameter where needed in the other
  *         HAL_MRSUBG_TIMER* APIs
  * @return absolute current time expressed in system time units (1 us).
  */
uint64_t HAL_MRSUBG_TIMER_GetCurrentSysTime(void)
{
  uint32_t current_machine_time;
  return _get_system_time_and_machine(&current_machine_time);
}

/* -------------------------- Virtual timer APIs ---------------------------- */

/**
  * @brief Starts a one-shot virtual timer for the given relative timeout value expressed in us
  * @param timerHandle: The virtual timer
  * @param usRelTimeout: The relative time, from current time, expressed in us
  * @retval 0 if the timerHandle is valid.
  * @retval 1 if the timerHandle is not valid. It is already started.
  */
uint32_t HAL_MRSUBG_TIMER_StartVirtualTimer(VTIMER_HandleType_t *timerHandle, uint64_t usRelTimeout)
{
  uint8_t retVal;
  retVal = _start_timer(timerHandle, (HAL_MRSUBG_TIMER_GetCurrentSysTime() + usRelTimeout));
  _virtualTimeBaseEnable(ENABLE);

  return retVal;
}

/**
  * @brief Starts a one-shot virtual timer for the given relative timeout value expressed in ms
  * @param timerHandle: The virtual timer
  * @param msRelTimeout: The relative time, from current time, expressed in ms
  * @retval 0 if the timerHandle is valid.
  * @retval 1 if the timerHandle is not valid. It is already started.
  */
uint32_t HAL_MRSUBG_TIMER_StartVirtualTimerMs(VTIMER_HandleType_t *timerHandle, uint32_t msRelTimeout)
{
  uint64_t time = msRelTimeout * 1000;
  uint8_t retVal;
  retVal = _start_timer(timerHandle, (HAL_MRSUBG_TIMER_GetCurrentSysTime() + time));
  _virtualTimeBaseEnable(ENABLE);

  return retVal;
}

/**
  * @brief  Stops the one-shot virtual timer specified if found
  * @param  timerHandle: The virtual timer
  * @retval None
  */
void HAL_MRSUBG_TIMER_StopVirtualTimer(VTIMER_HandleType_t *timerHandle)
{
  VTIMER_HandleType_t *rootNode = _remove_timer_in_queue(MRSUBG_TIMER_Context.rootNode, timerHandle);
  uint8_t expired = 0;
  timerHandle->active = FALSE;
  if (MRSUBG_TIMER_Context.rootNode != rootNode)
  {
    MRSUBG_TIMER_Context.rootNode = _update_user_timeout(rootNode, &expired);
    if (expired)
    {
      /* A new root timer is already expired, mimic timer expire */
      INCREMENT_EXPIRE_COUNT;
    }
  }
  else
  {
    MRSUBG_TIMER_Context.rootNode = rootNode;
  }
}

/**
  * @brief Returns the absolute expiry time of a running virtual timer expressed in internal system time units (us).
  * @param timerHandle: The virtual timer
  * @retval sysTime: Absolute time expressed in internal system time units (us).
  */
uint64_t HAL_MRSUBG_TIMER_ExpiryTime(VTIMER_HandleType_t *timerHandle)
{
  return timerHandle->expiryTime;
}

/**
  * @brief  Virtual timer Timeout Callback. It signals that a host timeout occurred.
  * @retval None
  */
void HAL_MRSUBG_TIMER_TimeoutCallback(void)
{
  /* Disable host timer */
  LL_MRSUBG_TIMER_DisableCPUWakeupTimer(MR_SUBG_GLOB_RETAINED);
  INCREMENT_EXPIRE_COUNT_ISR;
  /* Clear the interrupt */
  LL_MRSUBG_TIMER_ClearFlag_CPUWakeup(MR_SUBG_GLOB_MISC);
  LL_MRSUBG_TIMER_IsActiveFlag_CPUWakeup(MR_SUBG_GLOB_MISC);
}

/**
  * @brief  Returns the number of timers in the queue.
  * @return number of timers in the queue.
  */
uint32_t HAL_MRSUBG_TIMER_GetPendingTimers(void)
{
  VTIMER_HandleType_t *curr = MRSUBG_TIMER_Context.rootNode;
  uint32_t counter = 0;
  while (curr != NULL)
  {
    counter++;
    curr = curr->next;
  }
  return counter;
}

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup MRSUBG_Timer_Private_Functions MRSUBG TIMER Private Functions
  * @{
  */

static void _get_calibration_data(void)
{
  uint16_t scm_counter_currval;
  uint32_t last_interpolated_freq;

