stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg_timer.c
  scm_counter_currval = LL_MRSUBG_TIMER_GetSCM(MR_SUBG_GLOB_MISC);
  if ((scm_counter_currval != 0) && (scm_counter_currval != MRSUBG_TIMER_Context.last_scm_counter))
  {
    MRSUBG_TIMER_Context.slow_clock_freq = ((32ull * \
                                             (uint64_t)MRSUBG_TIMER_Context.fast_clock_freq * 1000) /  \
                                            scm_counter_currval);
    MRSUBG_TIMER_Context.last_scm_counter = scm_counter_currval;
    last_interpolated_freq = MRSUBG_TIMER_Context.interpolated_freq;
    MRSUBG_TIMER_Context.interpolated_freq = (16u * MRSUBG_TIMER_Context.slow_clock_freq) / 1000;
    if (last_interpolated_freq == 0)
    {
      MRSUBG_TIMER_Context.last_interpolated_freq = MRSUBG_TIMER_Context.interpolated_freq;
    }
    else
    {
      MRSUBG_TIMER_Context.last_interpolated_freq = last_interpolated_freq;
    }
    MRSUBG_TIMER_Context.slow_clock_freq /= 1000;
    MRSUBG_TIMER_Context.timer_max_value = (((uint64_t)TIMER_MAX_VALUE * 1000000ull) /  \
                                            MRSUBG_TIMER_Context.interpolated_freq);
  }
}

static void _timer_calibrate(void)
{
  uint8_t scm_transitory = 0;
  /* wait for SCM to leave reset state value */
  while (LL_MRSUBG_TIMER_GetSCM(MR_SUBG_GLOB_MISC) == 0);
  /* wait for SCM to reach a stable slow clock value after a transitory startup period */
  while ((LL_MRSUBG_TIMER_GetSCM(MR_SUBG_GLOB_MISC) != ((32ull * (uint64_t)MRSUBG_TIMER_Context.fast_clock_freq) /
                                                        SLOW_CLOCK_WORKING_FREQ)) &&  \
         (scm_transitory++ < MAX_SCM_DELAY_COUNT))
  {
    HAL_Delay(SCM_DELAY_MS);
  }
  _get_calibration_data();
}

static void _update_xtal_startup_time(void)
{
  uint16_t time;

  time = ((MRSUBG_TIMER_Context.hs_startup_time * MRSUBG_TIMER_Context.slow_clock_freq) / 1000000ull);
  if (time >= TIME_MAX_VALUE)
  {
    time = TIME_MAX_VALUE;
  }
  if (time < 16)
  {
    time = 20;
  }

  LL_MRSUBG_TIMER_SetWakeupOffset(MR_SUBG_GLOB_RETAINED, (uint8_t)time);
}

static void _updateCalibrationData(void)
{
  _get_calibration_data();
  _update_xtal_startup_time();
  ATOMIC_SECTION_BEGIN();
  _update_system_time();
  ATOMIC_SECTION_END();
}

static void _calibration_callback(void *handle)
{
  MRSUBG_TIMER_Context.calibration_in_progress = TRUE;
}

static void _update_system_time(void)
{
  uint32_t current_machine_time;
  uint64_t new_time;

  current_machine_time = LL_MRSUBG_TIMER_GetAbsoluteTime(MR_SUBG_GLOB_MISC) & TIMER_MAX_VALUE;
  new_time = ((uint64_t)TIME_ABSDIFF(current_machine_time, MRSUBG_TIMER_Context.last_calibration_machine_time) \
              * 1000000ull) / MRSUBG_TIMER_Context.last_interpolated_freq;
  MRSUBG_TIMER_Context.cumulative_time = MRSUBG_TIMER_Context.last_calibration_time + new_time;

  if (TIME_ABSDIFF(current_machine_time,
                   MRSUBG_TIMER_Context.last_calibration_machine_time) < MRSUBG_TIMER_Context.calibration_machine)
  {
    if (MRSUBG_TIMER_Context.periodic_calibration == 0)
    {
      /* When accounting for slow clock frequency oscillations over time:
       * In wrap around conditions of the HW timer, timer_max_value
       * added to the cumulative time needs to be calculated using
       * last_interpolated_freq, used until this calibration cycle.
       */
      MRSUBG_TIMER_Context.cumulative_time += (((uint64_t)TIMER_MAX_VALUE * 1000000ull) /
                                               MRSUBG_TIMER_Context.last_interpolated_freq);
    }
    else
    {
      /* Account for elapsed time when periodic_calibrations are set & a wraparound of the register occurs */
      MRSUBG_TIMER_Context.cumulative_time += MRSUBG_TIMER_Context.periodicCalibrationInterval;
    }
  }
  MRSUBG_TIMER_Context.last_calibration_machine_time = current_machine_time;
  MRSUBG_TIMER_Context.last_calibration_time = MRSUBG_TIMER_Context.cumulative_time;
  MRSUBG_TIMER_Context.last_interpolated_freq = MRSUBG_TIMER_Context.interpolated_freq;
  /* When accounting for slow clock frequency oscillations over time:
   * periodicCalibrationInterval (used as timeout for the next calibration cycle)
   * has to be calculated dynamically using the current frequency value.
   */
  MRSUBG_TIMER_Context.periodicCalibrationInterval = _machinetime_to_us(MRSUBG_TIMER_Context.calibration_machine);
}

static uint64_t _us_to_machinetime(uint64_t time)
{
  return ((uint64_t)(time * MRSUBG_TIMER_Context.interpolated_freq) / 1000000ull);
}

static uint64_t _machinetime_to_us(uint64_t time)
{
  return ((time * 1000000ull) / MRSUBG_TIMER_Context.interpolated_freq);
}

static uint64_t _get_system_time_and_machine(uint32_t *current_machine_time)
{
  uint64_t new_time;

  ATOMIC_SECTION_BEGIN();
  *current_machine_time =  LL_MRSUBG_TIMER_GetAbsoluteTime(MR_SUBG_GLOB_MISC);
  new_time = ((uint64_t)TIME_ABSDIFF(*current_machine_time, MRSUBG_TIMER_Context.last_calibration_machine_time) \
              * 1000000ull) / MRSUBG_TIMER_Context.interpolated_freq;
  new_time += MRSUBG_TIMER_Context.cumulative_time;
  if (new_time < MRSUBG_TIMER_Context.last_system_time)
  {
    new_time += MRSUBG_TIMER_Context.timer_max_value;
  }
  MRSUBG_TIMER_Context.last_system_time = new_time;

  ATOMIC_SECTION_END();

  return new_time;
}

static int32_t _start_timer(VTIMER_HandleType_t *timerHandle, uint64_t time)
{
  uint8_t expired = 0;

  /* The timer is already started*/
  if (timerHandle->active)
  {
    return 1;
  }
  timerHandle->expiryTime = time;
  timerHandle->active = TRUE;
  if (_insert_timer_in_queue(MRSUBG_TIMER_Context.rootNode, timerHandle) == timerHandle)
  {
    MRSUBG_TIMER_Context.rootNode = _update_user_timeout(timerHandle, &expired);
    if (expired)
    {
      /* A new root timer is already expired, mimic timer expire that is normally signaled
       through the interrupt handler that increase the number of expired timers*/
      INCREMENT_EXPIRE_COUNT;
    }
  }
  return expired;
}

/* Set timeout and skip non active timers */
static VTIMER_HandleType_t *_update_user_timeout(VTIMER_HandleType_t *rootNode, uint8_t *expired)
{
  VTIMER_HandleType_t *curr = rootNode;
  VTIMER_HandleType_t *rootOrig = rootNode;
  int64_t delay;
  *expired = 0;
  while (curr != NULL)
  {
    if (curr->active)
    {
      ATOMIC_SECTION_BEGIN();
      delay = curr->expiryTime - HAL_MRSUBG_TIMER_GetCurrentSysTime();
      if (delay > 0)
      {
        /* Protection against interrupt must be used to avoid that the called function will be interrupted
          and so the timer programming will happen after the target time is already passed
          leading to a timer expiring after timer wraps, instead of the expected delay */
        VTIMER_SetWakeupTime(delay, TRUE);
      }
      else
      {
        *expired = 1;
      }
      ATOMIC_SECTION_END();
      break;
    }
    curr = curr->next;
  }
  if (*expired)
  {
    return rootOrig;
  }

