stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg_timer.c
  return curr;
}

static uint32_t VTIMER_SetWakeupTime(uint64_t delay, BOOL allow_sleep)
{
  uint32_t current_time;
  uint32_t delay_mtu;

  delay_mtu = _us_to_machinetime(delay);
  /* If the delay is too small round to minimum 2 tick */
  delay_mtu = MAX(32, delay_mtu);
  current_time = LL_MRSUBG_TIMER_GetAbsoluteTime(MR_SUBG_GLOB_MISC);
  /* 4 least significant bits are not taken into account. Then let's round the value */
  LL_MRSUBG_TIMER_SetCPUWakeupTime(MR_SUBG_GLOB_RETAINED, ((current_time + (delay_mtu + 8)) & TIMER_MAX_VALUE));
  LL_MRSUBG_TIMER_EnableCPUWakeupTimer(MR_SUBG_GLOB_RETAINED);

  return current_time;
}

static VTIMER_HandleType_t *_insert_timer_in_queue(VTIMER_HandleType_t *rootNode, VTIMER_HandleType_t *handle)
{
  VTIMER_HandleType_t *current = rootNode;
  VTIMER_HandleType_t *prev = NULL;
  VTIMER_HandleType_t *returnValue = rootNode;

  while ((current != NULL) && (current->expiryTime < handle->expiryTime))
  {
    prev = current;
    current = current->next;
  }

  handle->next = current;

  if (prev == NULL)
  {
    /* We are the new root */
    returnValue = handle;
  }
  else
  {
    prev->next = handle;
  }

  return returnValue;
}

static void _virtualTimeBaseEnable(FunctionalState state)
{
  if (state != DISABLE)
  {
    if (MRSUBG_TIMER_Context.enableTimeBase == FALSE)
    {
      _calibration_callback(&MRSUBG_TIMER_Context.calibrationTimer);
      MRSUBG_TIMER_Context.enableTimeBase = TRUE;
    }
  }
  else
  {
    HAL_MRSUBG_TIMER_StopVirtualTimer(&MRSUBG_TIMER_Context.calibrationTimer);
    MRSUBG_TIMER_Context.enableTimeBase = FALSE;
  }
}

static VTIMER_HandleType_t *_remove_timer_in_queue(VTIMER_HandleType_t *rootNode, VTIMER_HandleType_t *handle)
{
  VTIMER_HandleType_t *current = rootNode;
  VTIMER_HandleType_t *prev = NULL;
  VTIMER_HandleType_t *returnValue = rootNode;

  while ((current != NULL) && (current != handle))
  {
    prev = current;
    current = current->next;
  }

  if (current == NULL)
  {
    /* Not found */
  }
  else if (current == rootNode)
  {
    /* New root node */
    returnValue = current->next;
  }
  else
  {
    prev->next = current->next;
  }

  return returnValue;
}

/* Check the number of expired timer from rootNode (ordered list of timers) and return the list of expired timers */
static VTIMER_HandleType_t *_check_callbacks(VTIMER_HandleType_t *rootNode, VTIMER_HandleType_t **expiredList)
{

  VTIMER_HandleType_t *curr = rootNode;
  VTIMER_HandleType_t *prev = NULL;
  VTIMER_HandleType_t *returnValue = rootNode;
  *expiredList = rootNode;

  int64_t delay;
  uint32_t expiredCount = 0;

  while (curr != NULL)
  {

    if (curr->active)
    {
      delay = curr->expiryTime - HAL_MRSUBG_TIMER_GetCurrentSysTime();

      if (delay > 5)
      {
        /* End of expired timers list */
        break;
      }
    }

    prev = curr;
    curr = curr->next;
    expiredCount++;
  }

  if (expiredCount)
  {
    /* Some timers expired */
    prev->next = NULL;
    returnValue = curr;
  }
  else
  {
    /* No timer expired */
    *expiredList = NULL;
  }

  return returnValue;
}

/**
  * @brief MRSUBG TIMER MSP Init
  * @retval None
  */
__weak void HAL_MRSUBG_TIMER_MspInit(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_MRSUBG_TIMER_MspInit could be implemented in the user file
    */
}

/**
  * @brief MRSUBG TIMER MSP DeInit
  * @retval None
  */
__weak void HAL_MRSUBG_TIMER_MspDeInit(void)
{

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_MRSubG_MspDeInit could be implemented in the user file
    */
}

__weak void HAL_MRSUBG_TIMER_CPU_WKUP_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_MRSUBG_TIMER_CPU_WKUP_Callback() can be implemented in the user file
    */
}

void HAL_MRSUBG_TIMER_CPU_WKUP_IRQHandler(void)
{
  HAL_MRSUBG_TIMER_CPU_WKUP_Callback();
}

/**
  * @}
  */

#endif /* HAL_MRSUBG_TIMER_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
